{
  "backend/main.mo": "Motoko actor that stores contact form submissions in a map, exposing functions to submit, retrieve by ID, and list all entries sorted by name/email.",
  "feature_evidence.json": "Feature evidence report documenting the replacement of the gold/cream/charcoal color palette with a white and light blue theme across all frontend components and config files.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of each frontend source file, describing the color theme updates and component responsibilities across the Furaat site.",
  "frontend/index.css": "Root CSS file that imports Tailwind layers and defines shadcn-style CSS custom properties for light and dark theme color tokens.",
  "frontend/index.html": "HTML entry point for the Vite/React app, mounting the React root and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that renders the Home page as the sole route.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying company mission, vision, and core values cards with light blue accent styling and decorative background elements.",
  "frontend/src/components/ContactForm.tsx": "Controlled contact form component with validation, submission via React Query mutation, and a success confirmation state using blue-themed styling.",
  "frontend/src/components/ContactSection.tsx": "Contact section combining a brand-blue contact details panel and the ContactForm component in a two-column layout with section header.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, quick links, services list, contact details, social media icons, and a copyright bar.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header with a top bar, logo, desktop nav links, a 'Get in Touch' CTA, and a responsive mobile menu with smooth-scroll behavior.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a background image, overlay, headline, subheadline, CTA buttons, and key business stats.",
  "frontend/src/components/ServiceCard.tsx": "Reusable card component displaying a service icon, title, description, and a 'Learn More' button with hover animations.",
  "frontend/src/components/ServicesSection.tsx": "Section that renders a grid of eight ServiceCards covering Furaat's offerings, with a section header and smooth-scroll to contact on 'Learn More'.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Exports a `useSubmitContactForm` mutation hook that calls the backend's `submitContactForm` method and invalidates the contact entries query on success.",
  "frontend/src/index.css": "Global CSS file defining Tailwind base/components/utilities, CSS custom properties for a clean white and light blue color palette (light and dark modes), and utility classes for gradients, patterns, and typography using Playfair Display and Inter fonts.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/Home.tsx": "Home page component that composes the full single-page layout by rendering Header, Hero, ServicesSection, AboutSection, ContactSection, and Footer in order.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with oklch-based color tokens (brand, navy, offwhite), custom fonts, border radii, box shadows, and keyframe animations, with typography, container-queries, and animate plugins enabled.",
  "project_state.json": "Project state metadata file tracking schema version, feature list with IDs and requirements, and a summary describing the site as inspired by Rajoo and Furaat with a clean white and light blue visual theme."
}